Revit 2024 API
Entity Constructor (Entity)
 Constructs a new copy of the input ESEntity object.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Entity(
	Entity other
)
Visual Basic
Public Sub New ( _
	other As Entity _
)
Visual C++
public:
Entity(
	Entity^ other
)
Parameters
other
Type: Autodesk.Revit.DB.ExtensibleStorage.Entity
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Entity Class
Entity Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace